{"title": "Chest Pathology Detection Using Deep Learning With Non-medical Training", "authors": ["Yaniv Bar", "Idit Diamant", "Lior Wolf", "Sivan Lieberman", "Eli Konen", "Hayit Greenspan"], "emails": [], "orgs": ["The Blavatnik School of Computer Science, Tel-Aviv University", "Department of Biomedical Engineering, Tel-Aviv University", "The Blavatnik School of Computer Science, Tel-Aviv University", "Diagnostic Imaging Department, Sheba Medical Center, Tel Hashomer", "Diagnostic Imaging Department, Sheba Medical Center, Tel Hashomer", "Department of Biomedical Engineering, Tel-Aviv University"], "country": ["Israel", "Israel", "Israel", "Israel", "Israel", "Israel"], "keywords": ["Chest Radiography", "Computer-Aided Diagnosis Disease Categorization", "Deep Learning", "Deep Networks", "CNN"], "abstract": ["In this work, we examine the strength of deep learning approaches for pathology detection in chest radiographs.", "Convolutional neural networks (CNN) deep architecture classification approaches have gained popularity due to their ability to learn mid and high level image representations.", "We explore the ability of CNN learned from a non-medical dataset to identify different types of pathologies in chest x-rays.", "We tested our algorithm on a 433 image dataset.", "The best performance was achieved using CNN and GIST features.", "We obtained an area under curve (AUC) of 0.87-0.94 for the different pathologies.", "The results demonstrate the feasibility of detecting pathology in chest x-rays using deep learning approaches based on non-medical learning.", "This is a first-of-its-kind experiment that shows that Deep learning with ImageNet, a large scale non-medical image database may be a good substitute to domain specific representations, which are yet to be available, for general medical image recognition tasks."], "content": ["INTRODUCTION", "Chest radiographs are the most common examination in radiology. They are essential for the management of various diseases associated with high mortality and display a wide range of potential information, many of which is subtle. Most of the research in computer-aided detection and diagnosis in chest radiography has focused on lung nodule detection. Although the target of most research attention, lung nodules are a relatively rare finding in the lungs. The most common findings in chest X-rays include lung infiltrates, catheters and abnormalities of the size or contour of the heart ", "Initial studies on chest pathology detection in radiographs can be found in the literature ", "Deep neural networks have recently gained considerable interest due to the development of new variants of CNNs and the advent of efficient parallel solvers optimized for modern GPUs. Deep learning refers to machine learning models such as Convolutional Neural Networks (CNNs) that represent mid-level and high-level abstractions obtained from raw data (e.g. images) ", "In our work, we utilize the strength of deep learning approaches in a wide range of chest-related diseases. We also explore categorization of healthy versus pathology which is an important screening task. We empirically explore the use of CNNs for these tasks with a particular focus on pre-trained CNN that is learned from a large scale real-life and non-medical image database. We later show that categorization rates can be slightly improved by combining features extracted from CNN and common low-level visual features that are optimal for the task of object categorization.", "METHODS", "CNNs constitute a feed-forward family of deep networks, where intermediate layers receive as input the features generated by the former layer, and pass their outputs to the next layer. The strength of a deep network is in learning hierarchical layers of concept representation, corresponding to different levels of abstraction. For visual data, the low levels of abstraction might describe the different orientated edges in the image; middle levels might describe parts of an object while high layers refer to larger object parts and even the object itself. In this work, we tested the deep learning network capabilities in chest pathology detection", "Pre-trained CNN model using ImageNet", "We focus on the Decaf pre-trained CNN model ", "Selecting and Combining feature sets", "We tested several common descriptors that are known in the literature, including GIST ", "All features used in our work were normalized: each feature across all images has its mean subtracted, and is divided by its standard deviation. Following normalization, we applied fusion of different feature groups. Empirically we claim that fusing CNN intermediate layers features with GIST features captures the salient information that allows a more accurate categorization of our problem. We implemented a fusion approach of the different features by averaging the class probabilities obtained for each feature group. The algorithm flowchart is described in ", "EXPERIMENTS AND RESULTS", "Data", "Our dataset consists of 443 frontal chest x-ray images (DICOM format). The images were acquired from the Diagnostic Imaging Department of Sheba Medical Center (Tel-Hashomer, Israel). Two radiologists interpreted the X-rays, and this served as the reference gold standard. The radiologists examined all of the images independently. They then discussed and reached a consensus regarding the label of every image. For each image and pathology type, a positive or negative label was assigned. The images depict 3 chest pathology conditions: Right Pleural Effusion (44 images), Cardiomegaly (99 images) and Abnormal Mediastinum (110 images). Overall, the dataset contains 219 images with at least one pathology condition. The digitized images were cropped and centered.", "Experimental Results", "We started with a binary categorization task, per pathology. Classification was performed using a Support Vector Machine (SVM) classifier with leave-one-out-cross-validation method. For each binary categorization task, cases diagnosed with the examined pathology were labeled as positive cases, while cases that weren't diagnosed with this pathology were labeled as negative cases. We investigated the different linear and nonlinear kernels (linear, polynomial and RBF) using standard grid-search technique, and empirically selected the efficient non-linear intersection kernel. Three accuracy measures were examined: sensitivity, specificity and the area under the ROC curve (AUC). Sensitivity and Specificity are derived based on the optimal cut point on the ROC -the point on the curve closest to (0,1).", "Tables 1-3 present the experimental results. We report Decaf5 and Decaf6 baseline descriptors (Decaf7 gave less significant results). We note the boost in performance following the introduction of deep architecture descriptors. For all cases, the deep architecture descriptors outperform the GIST descriptor. Another improvement was gained by applying late fusion on the baseline descriptors: Decaf5, Decaf6 and GIST. In almost all cases the fused descriptor outperforms the deep architecture singlelayered descriptors. In several of the cases a clear improvement over the BoVW descriptor is shown. ", "CONCLUSIONS", "In conclusion, in this work we present a system for the medical application of chest pathology detection in radiograph images which uses CNN that is learned from a non-medical dataset (ImageNet). Unlike previous work on using pre-trained CNNs as a feature extraction method ", "Right Pleural Effusion Detection.", "Abnormal Mediastinum Detection.", "Cardiomegaly Detection, Healthy vs. Pathology Detection. ", "Fig. 1 .", "1", "Chest x-rays categories examples: (a)-(c) healthy; (d)-(f) enlarged heart (cardiomegaly); (g)-(i) enlarged mediastinum; (j)-(l) left or right effusion; (m) multiple pathologies: enlarged heart and mediastinum, left and right effusion.", "Fig. 2 .", "2", "An illustration of the architecture of the CNN used by", "Fig. 3 .", "3", "Algorithm flowchart.", "Fig. 4 .", "4", "ROCs of different examined pathologies.", "Table 1 .Table 2 .", "12", "AUC accuracy metric. Sensitivity accuracy metric.", null, null]}